# BuiltInFailures.RenderFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RenderFailures Class
BuiltInFailures Class Members See Also
---
Failures related to rendering.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RenderFailures
```

Visual Basic
---
```text
Public NotInheritable Class RenderFailures
```

Visual C++
---
```text
public ref class RenderFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RenderFailures
# See Also
BuiltInFailures..::..RenderFailures Members
Autodesk.Revit.DB Namespace